"""
В офисе, где работает программист Петр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.

Кондиционер может работать в следующих четырех режимах:

«freeze» — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.

«heat» — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.

«auto» — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.

«fan» — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.

Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.

Требуется написать программу, которая по заданной температуре в комнате troom, установленным на кондиционере желаемой температуре tcond и режиму работы определяет температуру, которая установится в комнате через час.
"""

from enum import Enum


class Mode(str, Enum):
    FREEZE = "freeze"
    HEAT = "heat"
    AUTO = "auto"
    FAN = "fan"


def solution(troom, tcond, mode):
    match mode:
        case Mode.AUTO:
            return tcond
        case Mode.FAN:
            return troom
        case Mode.FREEZE:
            if troom > tcond:
                return tcond
        case Mode.HEAT:
            if troom < tcond:
                return tcond
    return troom


troom, tcond = map(int, input().split())
mode = input()
print(solution(troom, tcond, mode))
